
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/10634489904)



<pre><code>Apply complete! Resources: 2 added, 4 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-master/runs/run-jcZUKSHNrcisaa2Z

Waiting for the plan to start...

Terraform v1.5.2
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=a302387976ce74579a87a903dcc6149f70895053]
data.aws_caller_identity.current: Reading...
data.aws_iam_role.role: Reading...
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=trigger_user_scan]
aws_dynamodb_table.Link_table: Refreshing state... [id=Link_table]
aws_dynamodb_table.Register: Refreshing state... [id=Register]
aws_s3_bucket.website: Refreshing state... [id=mtchoun-mouh.mongulu.cm]
aws_s3_bucket.images: Refreshing state... [id=djansang]
aws_api_gateway_rest_api.api: Refreshing state... [id=gozv19c3jf]
aws_dynamodb_table.Users: Refreshing state... [id=Users]
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]
aws_lambda_function.scan: Refreshing state... [id=scan_user_consulcam]
aws_lambda_function.lambda: Refreshing state... [id=user_registration_consulcam]
aws_api_gateway_resource.resource: Refreshing state... [id=gtenoa]
module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-gozv19c3jf-gtenoa-OPTIONS]
aws_api_gateway_method.method: Refreshing state... [id=agm-gozv19c3jf-gtenoa-POST]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.target: Refreshing state... [id=trigger_user_scan-lambda]
module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-gozv19c3jf-gtenoa-OPTIONS-200]
module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-gozv19c3jf-gtenoa-OPTIONS]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-gozv19c3jf-gtenoa-POST-200]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-gozv19c3jf-gtenoa-POST]
module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-gozv19c3jf-gtenoa-OPTIONS-200]
aws_api_gateway_deployment.test: Refreshing state... [id=7suq19]
local_file.index_page: Refreshing state... [id=3df23f6ccd0c737240f079546f3bd4cefc59b440]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=mtchoun-mouh.mongulu.cm]
aws_s3_bucket_object.example_file: Refreshing state... [id=index.html]
aws_s3_bucket_policy.website: Refreshing state... [id=mtchoun-mouh.mongulu.cm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "user_registration_consulcam"
      ~ last_modified                  = "2023-08-07T19:40:10.000+0000" -> (known after apply)
      ~ layers                         = [] -> (known after apply)
      ~ source_code_hash               = "Alfc5+hIWkPKzz7W6FQbDTns5SJFRvX1qVA0IcYPzLQ=" -> "aG/693OgtesclFbtQG3JpowPoOxVEki6ETbi5wlrhnw="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (16 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "MAINTAINER_MAIL" = (sensitive value)
                # (8 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.scan will be updated in-place
  ~ resource "aws_lambda_function" "scan" {
        id                             = "scan_user_consulcam"
      ~ last_modified                  = "2024-08-29T23:46:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "Jhe7k5MLImZLUspkUA3PeCwJyRBxXG+L/jXk1odHcdY=" -> "aG/693OgtesclFbtQG3JpowPoOxVEki6ETbi5wlrhnw="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "MAINTAINER_MAIL" = (sensitive value)
                # (8 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_layer_version.test_lambda_layer will be created
  + resource "aws_lambda_layer_version" "test_lambda_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.7",
          + "python3.8",
        ]
      + created_date                = (known after apply)
      + filename                    = "make_lamda_layer/python.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "test_lambda_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (12 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

Plan: 2 to add, 4 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.74096/mo +$0.0

------------------------------------------------------------------------

aws_lambda_layer_version.test_lambda_layer: Creating...
local_file.index_page: Creating...
local_file.index_page: Creation complete after 0s [id=c845316bee69b44546aed5f465d68859a00ebc56]
aws_s3_bucket.images: Modifying... [id=djansang]
aws_lambda_function.scan: Modifying... [id=scan_user_consulcam]
aws_s3_bucket.website: Modifying... [id=mtchoun-mouh.mongulu.cm]
aws_s3_bucket.images: Modifications complete after 5s [id=djansang]
aws_s3_bucket.website: Modifications complete after 6s [id=mtchoun-mouh.mongulu.cm]
aws_lambda_function.scan: Modifications complete after 7s [id=scan_user_consulcam]
aws_lambda_layer_version.test_lambda_layer: Still creating... [10s elapsed]
aws_lambda_layer_version.test_lambda_layer: Creation complete after 10s [id=arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:6]
aws_lambda_function.lambda: Modifying... [id=user_registration_consulcam]
aws_lambda_function.lambda: Still modifying... [id=user_registration_consulcam, 10s elapsed]
aws_lambda_function.lambda: Modifications complete after 13s [id=user_registration_consulcam]

Apply complete! Resources: 2 added, 4 changed, 0 destroyed.

Outputs:

register_table = "Register"
stage_url = "https://gozv19c3jf.execute-api.eu-central-1.amazonaws.com/dev"
website_url = "http://mtchoun-mouh.mongulu.cm.s3-website.eu-central-1.amazonaws.com"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":186,"Program":"tfcmt","SHA1":"cf9b9b9ead50d03fce5e22a8bd59625990775a4c","Vars":{},"WorkflowName":"Deploy cases"} -->